Public Attributes | List of all members
API_PrimPict Struct Reference
Geometry | Drawing Primitives
A picture inside a placed drawing. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Prim_Head  | head
General primitive element header.
short  | pixelSizeX
Physical x size in pixels of the original picture.
short  | pixelSizeY
Physical y size in pixels of the original picture.
double  | rotAngle
The rotation angle.
API_Box  | destBox
Bounding box of the picture on the layout (without rotation and mirroring).
API_ColorDepthID  | colorDepth
Color depth of the image.
API_PictureFormat  | storageFormat
Storage format of the picture.
GS::uchar_t  | pictName [API_UniLongNameLen]
Name of the picture as a Unicode string.
char  | mime [128]
MIME string identifying the image format.
API_AnchorID  | anchor
The anchor point of the picture.
bool  | transparent
Tells if the picture is transparent.
bool  | mirrored
Tells if the picture is mirrored.
Detailed Description
A picture inside a placed drawing.
Remarks
This structure formerly described a picture on a placed drawing on a PlotMaker layout. Since layouting was integrated into Archicad, it is the part of the drawing content of a API_DrawingType element. Many of the data members have similar meanings to those of API_PictureType. The picture data is passed in the par1 parameter of the ShapePrimsProc function. The par2 parameter contains the standard MIME type of the picture. The picture is not clipped by the border of the drawing on the layout. (Note: this is different from the behavior in PlotMaker.) The picture here was imported as drawing, rotated, then placed on the layout, and rotated back. Its bounding polygon was also adjusted. If you need the original picture data, switch to the drawing database, and fetch the information from there with ACAPI_Element_Get and ACAPI_Element_GetMemo.
Member Data Documentation
◆ anchor
 API_PrimPict::anchor
The anchor point of the picture.
◆ colorDepth
 API_PrimPict::colorDepth
Color depth of the image.
◆ destBox
 API_PrimPict::destBox
Bounding box of the picture on the layout (without rotation and mirroring).
◆ head
 API_PrimPict::head
General primitive element header.
◆ mime
 API_PrimPict::mime
MIME string identifying the image format.
◆ mirrored
 API_PrimPict::mirrored
Tells if the picture is mirrored.
◆ pictName
 API_PrimPict::pictName
Name of the picture as a Unicode string.
◆ pixelSizeX
 API_PrimPict::pixelSizeX
Physical x size in pixels of the original picture.
◆ pixelSizeY
 API_PrimPict::pixelSizeY
Physical y size in pixels of the original picture.
◆ rotAngle
 API_PrimPict::rotAngle
The rotation angle.
◆ storageFormat
 API_PrimPict::storageFormat
Storage format of the picture.
◆ transparent
 API_PrimPict::transparent
Tells if the picture is transparent.